Revit 2026 API

# SpatialFieldManagerAddSpatialFieldPrimitive(Face, Transform) Method

---

Creates empty analysis results primitive associated with a face and a transform.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int AddSpatialFieldPrimitive(
	Face face,
	Transform trf
)
```
```vb
Public Function AddSpatialFieldPrimitive (
	face As Face,
	trf As Transform
) As Integer
```
```cpp
public:
int AddSpatialFieldPrimitive(
	Face^ face,
	Transform^ trf
)
```
```fsharp
member AddSpatialFieldPrimitive :
        face : Face *
        trf : Transform -> int
```

#### Parameters

face Face
     Face to be associated with the primitive
trf Transform
     Conformal Transform to be applied to %face%

#### Return Value

Int32 Unique index of primitive for future references

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | trf is not conformal. |

This method accepts a reference to a model face, and a transform to be applied to that face, allowing the display of analytical results on faces which are not strictly a part of the Revit model.

This method should not be used if the transform is the identity transform, i.e. the intent is to display results on a face which is part of the Revit model. In that case, use the overload of this method which accepts a reference.

If the input face is from the geometry of a symbol, the face will be considered to be in the location specified by its symbol geometry. If your intention is to transform the face relative to its location in the instance, your input transform must consist of the instance's transform left multiplied by the extra transform to get the results you expect.

#### Reference

SpatialFieldManager Class

AddSpatialFieldPrimitive Overload

Autodesk.Revit.DB.Analysis Namespace